
## Plan Result (aat)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * module.redis6-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat"
      + name                    = "appinsights-connection-string-mc"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.redis6-cache.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Cache/redis/xui-webapp-aat"
        name                          = "xui-webapp-aat"
        tags                          = {
            "application"         = "expert-ui"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#xui-pipeline"
            "environment"         = "staging"
            "managedBy"           = "Expert UI"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 1330 -> 642
          ~ maxmemory_delta                         = 1330 -> 642
          ~ maxmemory_reserved                      = 1330 -> 642
            # (8 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + appInsightsConnectionString   = (sensitive value)
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3771,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->